zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA166/MCXA166.h
/* The count of TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_CFG_W_MBC_DOM0_MEM2_BLK_CFG_W */
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_CFG_W_MBC_DOM0_MEM2_BLK_CFG_W_COUNT (1U)

/* The count of TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_CFG_W_MBC_DOM0_MEM2_BLK_CFG_W */
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_CFG_W_MBC_DOM0_MEM2_BLK_CFG_W_COUNT2 (1U)


/*!
 * @}
 */ /* end of group TRDC_Register_Masks */


/* TRDC - Peripheral instance base addresses */
/** Peripheral MBC0 base address */
#define MBC0_BASE                                (0x4008E000u)
/** Peripheral MBC0 base pointer */
#define MBC0                                     ((TRDC_Type *)MBC0_BASE)
/** Array initializer of TRDC peripheral base addresses */
#define TRDC_BASE_ADDRS                          { MBC0_BASE }
/** Array initializer of TRDC peripheral base pointers */
#define TRDC_BASE_PTRS                           { MBC0 }
#define MBC0_MEMORY_CFG_WORD_COUNT {1,2,4,1}
#define MBC1_MEMORY_CFG_WORD_COUNT {1,1,1,1}
#define MBC2_MEMORY_CFG_WORD_COUNT {9,6,1,1}
#define MBC3_MEMORY_CFG_WORD_COUNT {3,0,0,0}
#define MBC_MEMORY_CFG_WORD_COUNT {MBC0_MEMORY_CFG_WORD_COUNT , MBC1_MEMORY_CFG_WORD_COUNT, MBC2_MEMORY_CFG_WORD_COUNT, MBC3_MEMORY_CFG_WORD_COUNT}
#define MBC0_MEMORY_NSE_WORD_COUNT {1,1,1,1}
#define MBC1_MEMORY_NSE_WORD_COUNT {1,1,1,1}
#define MBC2_MEMORY_NSE_WORD_COUNT {3,2,1,1}
#define MBC3_MEMORY_NSE_WORD_COUNT {1,0,0,0}
#define MBC_MEMORY_NSE_WORD_COUNT {MBC0_MEMORY_NSE_WORD_COUNT , MBC1_MEMORY_NSE_WORD_COUNT, MBC2_MEMORY_NSE_WORD_COUNT, MBC3_MEMORY_NSE_WORD_COUNT}


/*!
 * @}
 */ /* end of group TRDC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- UDF Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UDF_Peripheral_Access_Layer UDF Peripheral Access Layer
 * @{
 */

/** UDF - Register Layout Typedef */
typedef struct {
  __IO uint32_t UDF_CTRL;                          /**< Control register, offset: 0x0 */
  __I  uint32_t UDF_STATUS;                        /**< Status register, offset: 0x4 */
  __O  uint32_t UDF_WR_DATA;                       /**< Data In Register, offset: 0x8 */
  __I  uint32_t UDF_RD_DATA;                       /**< Data Out Register, offset: 0xC */
} UDF_Type;

/* ----------------------------------------------------------------------------
   -- UDF Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UDF_Register_Masks UDF Register Masks
 * @{
 */

/*! @name UDF_CTRL - Control register */
/*! @{ */

#define UDF_UDF_CTRL_salt_MASK                   (0xFFFFU)
#define UDF_UDF_CTRL_salt_SHIFT                  (0U)
/*! salt - Bits are internally XORed with i_custom */
#define UDF_UDF_CTRL_salt(x)                     (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_salt_SHIFT)) & UDF_UDF_CTRL_salt_MASK)

#define UDF_UDF_CTRL_lock_MASK                   (0x70000U)
#define UDF_UDF_CTRL_lock_SHIFT                  (16U)
/*! lock - Lock access to UDF */
#define UDF_UDF_CTRL_lock(x)                     (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_lock_SHIFT)) & UDF_UDF_CTRL_lock_MASK)

#define UDF_UDF_CTRL_reserved21_MASK             (0x380000U)
#define UDF_UDF_CTRL_reserved21_SHIFT            (19U)
/*! reserved21 - RFU */
#define UDF_UDF_CTRL_reserved21(x)               (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_reserved21_SHIFT)) & UDF_UDF_CTRL_reserved21_MASK)

#define UDF_UDF_CTRL_udf_en_MASK                 (0x1C00000U)
#define UDF_UDF_CTRL_udf_en_SHIFT                (22U)
/*! udf_en - Enable the UDF block */
#define UDF_UDF_CTRL_udf_en(x)                   (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_udf_en_SHIFT)) & UDF_UDF_CTRL_udf_en_MASK)

#define UDF_UDF_CTRL_reserved25_MASK             (0x2000000U)
#define UDF_UDF_CTRL_reserved25_SHIFT            (25U)
/*! reserved25 - RFU */
#define UDF_UDF_CTRL_reserved25(x)               (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_reserved25_SHIFT)) & UDF_UDF_CTRL_reserved25_MASK)

#define UDF_UDF_CTRL_reserved27_MASK             (0xC000000U)
#define UDF_UDF_CTRL_reserved27_SHIFT            (26U)
/*! reserved27 - RFU */
#define UDF_UDF_CTRL_reserved27(x)               (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_reserved27_SHIFT)) & UDF_UDF_CTRL_reserved27_MASK)

#define UDF_UDF_CTRL_flush_MASK                  (0x70000000U)
#define UDF_UDF_CTRL_flush_SHIFT                 (28U)
/*! flush - Flush UDF and return to reset state */
#define UDF_UDF_CTRL_flush(x)                    (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_flush_SHIFT)) & UDF_UDF_CTRL_flush_MASK)

#define UDF_UDF_CTRL_reserved31_MASK             (0x80000000U)
#define UDF_UDF_CTRL_reserved31_SHIFT            (31U)
/*! reserved31 - reserved */
#define UDF_UDF_CTRL_reserved31(x)               (((uint32_t)(((uint32_t)(x)) << UDF_UDF_CTRL_reserved31_SHIFT)) & UDF_UDF_CTRL_reserved31_MASK)
/*! @} */

/*! @name UDF_STATUS - Status register */
/*! @{ */

#define UDF_UDF_STATUS_o_status_MASK             (0x1FU)
#define UDF_UDF_STATUS_o_status_SHIFT            (0U)
/*! o_status - Status bits
 *  0b00001..5'b00001 = Reset
 *  0b00010..5'b00010 = Init
 *  0b00100..5'b00100 = Warmup
 *  0b01000..5'b01000 = Ready
 *  0b10000..5'b10000 = Error
 */
#define UDF_UDF_STATUS_o_status(x)               (((uint32_t)(((uint32_t)(x)) << UDF_UDF_STATUS_o_status_SHIFT)) & UDF_UDF_STATUS_o_status_MASK)

#define UDF_UDF_STATUS_rsv_MASK                  (0x7FFFFFE0U)
#define UDF_UDF_STATUS_rsv_SHIFT                 (5U)
/*! rsv - RFU */
#define UDF_UDF_STATUS_rsv(x)                    (((uint32_t)(((uint32_t)(x)) << UDF_UDF_STATUS_rsv_SHIFT)) & UDF_UDF_STATUS_rsv_MASK)

#define UDF_UDF_STATUS_o_wait_MASK               (0x80000000U)
#define UDF_UDF_STATUS_o_wait_SHIFT              (31U)
/*! o_wait - Indicates UDF is processing data */
#define UDF_UDF_STATUS_o_wait(x)                 (((uint32_t)(((uint32_t)(x)) << UDF_UDF_STATUS_o_wait_SHIFT)) & UDF_UDF_STATUS_o_wait_MASK)
/*! @} */

/*! @name UDF_WR_DATA - Data In Register */
/*! @{ */

#define UDF_UDF_WR_DATA_i_dat_MASK               (0xFFFFFFFFU)
#define UDF_UDF_WR_DATA_i_dat_SHIFT              (0U)
#define UDF_UDF_WR_DATA_i_dat(x)                 (((uint32_t)(((uint32_t)(x)) << UDF_UDF_WR_DATA_i_dat_SHIFT)) & UDF_UDF_WR_DATA_i_dat_MASK)
/*! @} */

/*! @name UDF_RD_DATA - Data Out Register */
/*! @{ */

#define UDF_UDF_RD_DATA_o_dat_MASK               (0xFFFFFFFFU)
#define UDF_UDF_RD_DATA_o_dat_SHIFT              (0U)
#define UDF_UDF_RD_DATA_o_dat(x)                 (((uint32_t)(((uint32_t)(x)) << UDF_UDF_RD_DATA_o_dat_SHIFT)) & UDF_UDF_RD_DATA_o_dat_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group UDF_Register_Masks */


/* UDF - Peripheral instance base addresses */
/** Peripheral UDF0 base address */
#define UDF0_BASE                                (0x400ED000u)
/** Peripheral UDF0 base pointer */
#define UDF0                                     ((UDF_Type *)UDF0_BASE)
/** Array initializer of UDF peripheral base addresses */
#define UDF_BASE_ADDRS                           { UDF0_BASE }
/** Array initializer of UDF peripheral base pointers */
#define UDF_BASE_PTRS                            { UDF0 }

/*!
 * @}
 */ /* end of group UDF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- UTICK Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UTICK_Peripheral_Access_Layer UTICK Peripheral Access Layer
 * @{
 */

